%% @author zouv
%% @doc @todo 名称库

-module(util_name).

%% ----- 玩家昵称 -----
%% 玩家昵称前缀1
-define(PLAYER_PREFIX_LIST_1, 
		["出爪子","出阔剑","出短棍","出大剑","出守护","出标枪","出秘银","出锁甲","出铁盔","出板甲","出加速"
		,"出死面","出回复","出艺人","出鞋子","出斗篷","出护符","出绿杖","出暗影","出拳套","出便鞋","出斗篷"
		,"出树枝","出腰带","出皮靴","出长袍","出圆环","出食人","出欢欣","出法杖","出极限","出远行","出相位"
		,"出假腿","出魂戒","出空明","出坚韧","出护腕","出幽灵","出挂件","出梅肯","出蓝鞋","出天鹰","出玄冥"
		,"出烟斗","出影龛","出头巾","出勇气","出韧鼓","出绿鞋","出羊刀","出紫苑","出风杖","出推推","出红杖"
		,"出小书","出蓝杖","出刷新","出纷争","出强袭","出龙心","出BKB","出冰甲","出血精","出林肯"
		,"出先锋","出刃甲","出镇魂","出挑战","出分身","出双刀","出邪力","出雷锤","出冰眼","出散华","出支配"
		,"出漩涡","出黯灭","出夜叉","出疯脸","出散失","出天堂","出圣剑","出金箍棒","出辉耀","出蝴蝶","出大炮"
		,"出晕锤","出狂战","出深渊","出水晶","出臂章","出隐刀","出虚灵","出恶魔","出鹰弓","出掠夺","出遗物"
		,"出振奋","出治疗","出虚无","出神秘","出能量","出精气","出活力","出淬毒","出圆盾","出点金","出穷盾"
		,"出魔杖","出祭品","出王戒","出补刀","出魔棒","出跳刀","跳大","单中","单上","拉野","速推","先手"
		,"辅助","后期","GANK","一血","双杀","三杀","四杀","五杀","超神","超鬼","猪队友","神对手","开黑"
        ,"二连坐","三连坐","四连坐","五连坐","补刀","带兵线","控线","推塔","DPS","路人","抢头","AOE","肉盾"
        ,"强退","神装","卖肉"]).
% ,"出阿托斯","大杀特杀","主宰比赛","杀人如麻","无人能挡","变态杀戮","妖怪杀戮","神般杀戮"

%% 玩家昵称前缀2
-define(PLAYER_PREFIX_LIST_2, 
		["宙斯","蜘蛛","月骑","幽鬼","影魔","隐刺","夜魔","血魔","修补匠","熊猫","熊德","小鱼人"
		,"小小","小强","小牛","小娜迦","小鹿","小黑","小狗","小Y","先知","仙龙","巫医","巫妖","团子"
		,"兔子","屠夫","痛苦","痛苦","死先","死骑","死法","斯温","水人","双头龙","术士","兽王","尸王"
		,"圣堂","圣骑","神灵","赏金","沙王","萨尔","人马","全能","全能","拍拍","末日","蚂蚁","龙骑","炼金"
		,"老虎","狼人","蓝胖","蓝猫","拉比克","骷髅王","卡尔","剧毒","巨魔","菊花猪","精灵","剑圣","火枪"
		,"火女","魂守","混沌","幻刺","猴子","黑鸟","海民","光鹿","光法","骨弓","骨法","复仇","斧子","凤凰"
		,"风行","飞龙","飞机","发条","恶巫","毒狗","电棍","地卜","敌法","大鱼人","大树","大屁股"
		,"大牛","大娜迦","大白马","船长","沉默","潮汐","冰女","冰魂","蝙蝠","白牛","暗牧","JJ脸"]).

%% 玩家昵称中缀1
-define(PLAYER_INFIX_LIST_1, ["的"]).

%% 玩家昵称中缀2
-define(PLAYER_INFIX_LIST_2, ["单杀","配合","对中","SOLO"]).

%% 玩家昵称后缀
-define(PLAYER_SUFFIX_LIST, 
		["全能","船长","兽王","人马","小牛","全能","熊猫","斯温","小小","大牛","大树","精灵","炼金","发条"
		,"龙骑","神灵","菊花猪","凤凰","海民","斧王","混沌","末日","小狗","死骑","狼人","夜魔","大屁股"
		,"屠夫","骷髅王","大鱼人","尸王","潮汐","大白马","白牛","沙王","敌法","火枪","剑圣","熊德","月骑"
		,"水人","小娜迦","猴子","老虎","隐刺","巨魔","飞机","小黑","圣堂","拍拍","复仇","赏金","血魔"
		,"骨弓","蜘蛛","小强","蚂蚁","幻刺","影魔","魂守","幽鬼","剧毒","地卜","电棍","小鱼人"
		,"JJ脸","大娜迦","冰女","小鹿","仙龙","圣骑","光法","宙斯","先知","沉默","火女","蓝猫","风行"
		,"萨尔","蓝胖","双头龙","修补匠","小Y","拉比克","痛苦","兔子","死先","恶巫","团子","巫妖"
		,"死法","骨法","黑鸟","痛苦","术士","毒狗","蝙蝠","暗牧","卡尔","飞龙","光鹿","巫医","冰魂"]).

%% ----- 竞技场机器人昵称 -----
%% 竞技场机器人昵称前缀
-define(PVP_PREFIX_LIST,
		["温柔的","内向的","腼腆的","害羞的","多疑的","直率的","活泼的","开朗的","滑稽的","可笑的","古怪的"
		 ,"怪异的","狭窄的","宽容的","猜忌的","多情的","冷淡的","热情的","放荡的","拘谨的","谨慎的","严格的"
		 ,"严厉的","凶残的","残忍的","无情的","懦弱的","怯弱的","卑鄙的","无耻的","下流的","无赖的","好色的"
		 ,"肮脏的","飘逸的","圣洁的","纯洁的","清纯的","可爱的","贤慧的","慈爱的","仁慈的","老实的","木讷的"
		 ,"慷慨的","大方的","随便的","暴躁的","急躁的","尖酸的","刻薄的","侠义的","忠诚的","开心的","幸福的"
		 ,"忧郁的","烦恼的","快乐的","失落的","矛盾的","痛苦的","希望的","平和的","坚定的","犹豫的","犹豫的"
		 ,"痛苦的","希望的","快乐的","忧郁的","烦恼的","开心的","失落的","幸福的","平和的","矛盾的","幸福的"
		 ,"忧郁的","烦恼的","快乐的","失落的","矛盾的","痛苦的","希望的","平和的","坚定的","犹豫的","忧郁的"
		 ,"烦恼的","开心的","失落的","开心的","震怒的","恼怒的","大怒的","气愤的","激怒的","发狂的","愤慨的"
		 ,"发火的","抓狂的","闷闷的","烦躁的","郁卒的","郁闷的","忧愁的","苦闷的","抑郁的","沮丧的","可惜的"
		 ,"尴尬的","遗憾的","羞耻的","愧疚的","羞愧的","后悔的","懊悔的","耻辱的","警觉的","傍徨的","着急的"
		 ,"焦急的","无聊的","孤独的","孤单的","寂寞的","空虚的"]).

%% 竞技场机器人昵称后缀
-define(PVP_SUFFIX_LIST,
		["统领","兽王","人马","神牛","骑士","酒仙","剑客","酋长","树精","精灵","术士","地精","武士","刚背兽"
		 ,"凤凰","巨牙","斧王","末日使","食尸鬼","领主","狼人","魔王","深渊","屠夫","骷髅王","鱼人","尸王"
		 ,"猎人","猛犸","裂魂人","沙王","敌法师","火枪手","剑圣","德鲁伊","月骑","变体灵","娜迦","长矛手"
		 ,"女祭祀","隐刺","巨魔","矮人","游侠","刺客","熊战士","复仇魂","狂魔","射手","母蜘蛛","地穴刺"
		 ,"编织者","幻刺","影魔","灵魂","幽鬼","蝮蛇","地卜师","幽魂","夜行者","假面","女妖","室女","魔女"
		 ,"精灵龙","圣骑士","守卫","神王","先知","魔导师","风暴","风行者","干扰者","工程师","双头龙","修补匠"
		 ,"萨满","祸乱","贤者","巫师","谜团","巫妖","死灵","法师","毁灭者","女王","恶魔","蝙蝠","暗牧"
		 ,"召唤师","巫医","船长","雷克萨","小牛","大熊猫","小小","大牛","大树","小精灵","菊花猪","斧子"
		 ,"小狗","死骑","夜魔","大屁股","大鱼人","潮汐","大白马","白牛","沙子","主宰","熊德","水人","小娜迦"
		 ,"猴子","老虎","飞机","小黑","拍拍","赏金","血魔","骨弓","蜘蛛","小强","蚂蚁","电棍","小鱼人"
		 ,"大娜迦","冰女","小鹿","唐僧","火女","蓝猫","白弓","萨尔","蓝胖子","炸弹人","拉比可","痛苦","兔子"
		 ,"团子","骨法","黑鸟","毒狗","卡尔","老鹿","冰魂","白虎","电魂","光法","美杜莎","拍拍熊","亚龙"
		 ,"直升机","宙斯","虎妞","破法","大鱼","小骷髅","光守","传说哥","骷髅","一姐","熊战","全能","牛头"
		 ,"黑弓","熊猫","修补","月女","斧头","莉娜","小炮","大骷髅","蛇发","老牛","国宝","露娜","导弹","矮子"]).

%% ====================================================================
%% API functions
%% ====================================================================
-export([
		 make_player_name/0,
		 make_pvp_name/0
		]).

%% ====================================================================
%% Internal functions
%% ====================================================================

%% 生成玩家昵称
make_player_name() ->
	case util:rand(1, 2) of
		1 ->
			PrefixList = ?PLAYER_PREFIX_LIST_1,
            InfixList = ?PLAYER_INFIX_LIST_1;
		_ ->
			PrefixList = ?PLAYER_PREFIX_LIST_2,
            InfixList = ?PLAYER_INFIX_LIST_2
	end,
	SuffixList = ?PLAYER_SUFFIX_LIST,
	Prefix = lists:nth(util:rand(1, length(PrefixList)), PrefixList),
	Infix = lists:nth(util:rand(1, length(InfixList)), InfixList),
	Suffix = lists:nth(util:rand(1, length(SuffixList)), SuffixList),
	lists:concat([Prefix, Infix, Suffix]).

%% 生成竞技场机器人昵称
make_pvp_name() ->
	PrefixList = ?PVP_PREFIX_LIST,
	SuffixList = ?PVP_SUFFIX_LIST,
	Prefix = lists:nth(util:rand(1, length(PrefixList)), PrefixList),
	Suffix = lists:nth(util:rand(1, length(SuffixList)), SuffixList),
	%io:format("make_pvp_name___1 ~ts~n", [erlang:list_to_binary(lists:concat([Prefix, Suffix]))]),
	lists:concat([Prefix, Suffix]).


